Repository: sweney/usersguideCZ
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: cs_cz

source: (Do not use the “Import Source Files” function during this exercise; you can experiment with it later, on your own.) You can close this window.
cs_cz: (Během tohoto cvičení nepoužívejte funkci "Kopírování souborů do zdrojového adresáře". S touto funkcí můžete později experimentovat sami na vlastní pěst.) Toto okna můžete zavřít.

source: Do not change any other settings, for the purposes of this tutorial.
cs_cz: Jiné nastavení pro účely tohoto tutoriálu měnit nemusíte.

source: Important: the purpose of this introduction to OmegaT is to acquaint you with the basic concepts of translation memory software.
cs_cz: Důležité:účelem tohoto úvodu do nástroje OmegaT je seznámit vás se základními koncepty softwaru pracujícího s překladovou pamětí.

source: Please note that owing to the pace at which OmegaT is being developed, the appearance of the screenshots and possibly some other information may have changed slightly.
cs_cz: Z důvodu rychlosti, kterou je OmegaT vyvíjena je možné, že se snímky obrazovky, popřípadě informace v tomto manuálu obsažené, mohou od programu samotného lišit.

source: Please proceed to Project 2 after completing Project 1!
cs_cz: Po dokončení Projektu 1 přejděte na Projekt 2!

source: A copy of the license is included in the section entitled “GNU Free Documentation License.”
cs_cz: Kopie této licence se nachází v sekci "GNU Free Documentation License"

source: Appendix
cs_cz: Dodatek

source: Beginners
cs_cz: začátečníky

source: Checking your translation
cs_cz: Ověření vašeho překladu

source: Confirm the segmentation rules and then creation of the project with OK.
cs_cz: Pravidla segmentace a vytvoření projektu potvrdíte stisknutím OK.

source: Consult the User’s Manual for further information.
cs_cz: Více informací najdete v manuálu.

source: Copyright
cs_cz: Autorská práva

source: Copyright © 2014 Susan Welsh and Marc Prior
cs_cz: Copyright ©Susan Welshová & Marc Prior

source: Cover illustration is from www.freeclipartnow.com, in the public domain.
cs_cz: Kresba na obale pochází z www.freeclipartnow.com a je volným dílem.

source: Creating a project
cs_cz: Zakládání projektu

source: Do not click on “Browse” or otherwise change the default locations of the project folders (directories). You have now created an empty project.
cs_cz: Neklikejte na "Procházet" ani jakkoli jinak neměňte výchozí umístění složek projektu (adresáře).Vytvořili jste nyní prázdný projekt.

source: Do the same with the Language Pattern field.
cs_cz: To stejné udělejte s polem Vzor jazyka.

source: Double-click on the file.
cs_cz: Na soubor dvakrát klikněte.

source: Downloading OmegaT
cs_cz: Stáhnutí OmegaT

source: Downloading the supplementary materials
cs_cz: Stažení doplňkových materiálů

source: English to Dutch
cs_cz: angličtina - holandština

source: English to French
cs_cz: angličtina - francouzština

source: English to German
cs_cz: angličtina - němčina

source: English to Italian
cs_cz: angličtina - italština

source: Final proofreading, correction, and delivery
cs_cz: Závěrečná korektura, opravy a doručení

source: Find your project in your file manager: it is a folder with the name of the project, containing the sub-folders /dictionary,/glossary,/omegat,/source, /target, /omegat, and /tm, and /glossary.
cs_cz: Najděte svůj projekt v průzkumníku souborů: je to složka se jménem projektu obsahující podsložky /dictionary,/glossary,/omegat,/source, /target, /omegat, and /tm, a /glossary.

source: Handling tags
cs_cz: Manipulace s tagy

source: If the language of your source text isn’t listed, pick a language that is, double-click on the Language Name field, and change it to the abbreviation for your language.
cs_cz: Pokud jazyk vašeho zdrojového textu není na seznamu, vyberte jazyk, který na něm je a dvakrát klikněte na pole s názvem jazyka a změňte ho na zkratku vašeho jazyka.

source: If you use OmegaT for any length of time in the future, you will want to customize the segmentation rules.
cs_cz: Pokud budete OmeguT používat častěji, budete si určitě chtít upravit pravidla segmentace.

source: Installing OmegaT
cs_cz: Instalace OmegaT

source: Installing a spelling dictionary
cs_cz: Instalace pravopisného slovníku? TODO

source: Intended readership
cs_cz: Cílová skupina pro tento manuál

source: Introduction
cs_cz: Úvod

source: It is not worth getting bogged down with fine-tuning the segmentation rules at this stage; the basic rules as supplied should work adequately for demonstration purposes, even for a different (source) language, provided its sentence punctuation rules are broadly similar (i.e., don’t use the Japanese segmentation rules if you are translating from Italian).
cs_cz: V tuto chvíli nemá smysl pravidla segmentace upravovat. Poskytnutá základní pravidla by měla pro účely demonstrace stačit, dokonce i pro jiný (zdrojový) jazyk, pokud je interpunkce podobná (např.: nepoužívejte pravidla segmentace pro japonštinu, pokud překládáte z italštiny).

source: Last updated: March 2014
cs_cz: Poslední aktualizace: březen 2014

source: Launch Open Office Writer and create a new text document.
cs_cz: Otevřete Open Office Writer a vytvořte nový textový dokument.

source: OmegaT for
cs_cz: OmegaT pro

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.2 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts.
cs_cz: Tento dokument můžete kopírovat, šířit nebo upravovat na základě ustanovení GNU Free Documentation License, verze 1.2 nebo jakékoliv později vydané nadací Free Software Foundation. TODO

source: Project 1: A simple MS Word file
cs_cz: Projekt 1: Jednoduchý dokument MS Word

source: Project 2: An HTML document
cs_cz: Projekt 2: HTML dokument

source: References to OmegaT’s more advanced or obscure functions have deliberately been omitted or kept to a minimum, since a description of them would almost certainly lead to you, as a new user, being unable to see the forest for the trees.
cs_cz: Odkazy na pokročilejší nebo skryté funkce nástroje byly úmyslně vynechány nebo zmíněny pouze krátce, protože jejich popis by vás, jako nové uživatele, mohl jednoduše zmást a pro stromy byste neviděli les.

source: Refers to OmegaT version: 3.0.8_2
cs_cz: Týká se OmegaT verze 3.0.8_2

source: Screenshots from OmegaT versions: 1.6.0, 3.0.8_2
cs_cz: Snímky obrazovky pochází z OmegaT verzí 1.6.0 a 3.0.8_2

source: See 6.B.1-6.B.4, below.
cs_cz: Podívejte se na 6.B.1-6.B.4 níže.

source: Table of Contents
cs_cz: Obsah

source: The second project uses an HTML file or set of files, downloaded from the Internet, and demonstrates OmegaT’s capability to deal with graphics, complex layout, and complex file structure.
cs_cz: Druhý projekt používá HTML soubor nebo sadu souborů, stažených z internetu, které demonstrují schopnosti nástroje vypořádat se s grafikou, komplexním rozvržením stránky a strukturou souboru.

source: The OmegaT user group
cs_cz: Uživatelská skupina aplikace OmegaT

source: The OmegaT user interface
cs_cz: Uživatelské prostředí OmegaT

source: The Project Files window is displayed, which is empty since your project does not yet contain any files.
cs_cz: Zobrazí se vám okno Soubory projektu, které je prázdné, protože váš projekt neobsahuje žádné soubory.

source: The first, to get you started, uses a simple MS Word file in the source language.
cs_cz: První projekt pro začátek používá jednoduchý MS Word soubor ve zdrojovém jazyce.

source: The glossary function
cs_cz: Funkce „Glosář“

source: The text search (find) function
cs_cz: Funkce „Hledat v textu“

source: Then use File > Open to Choose open any short MS Word document (.docx format) document in the source language.
cs_cz: Pro otevření jakéhokoli MS Word dokumentu (ve formátu .docx) použijte Soubor > Otevřít.

source: There you will learn how translation memories, glossaries, and the search function work.
cs_cz: V tom to projektu se naučíte, jak funguje překladatelská paměť, glosáš a funkce vyhledávání.

source: These capabilities can be used regardless of the file type (.docx, .xlsx, .odt, .txt, .html, etc.).
cs_cz: Tyto schopnosti nástroje OmegaT můžete používat nehledě na typ souboru (.docx, .xlsx, .odt, .txt, .html, etc.).

source: They are all empty.
cs_cz: Všechny jsou prázdné.

source: This does not demonstrate OmegaT’s full capabilities, but is intended to help the “newbie” grasp the most essential procedures.
cs_cz: Toto cvičení není ukázkou kompletních schopností programu OmegaT, ale slouží k tomu, aby "nováčci" pochopili základní procedury.

source: Translating
cs_cz: Překládání

source: Translation memory (fuzzy match function)
cs_cz: Překladová paměť (funkce „Přibližné překlady“

source: Validating tags, creating target documents
cs_cz: Ověřování tagů, vytváření cílových dokumentů

source: We ignore these in Project 1 only for training purposes.
cs_cz: Pro účely cvičení budeme tyto funkce v Projektu 1 ignorovat.

source: We provide here two projects for self-training.
cs_cz: Pro účely procvičení zde máme dva projekty.

source: What is a CAT tool and why are they useful?
cs_cz: Co to jsou CAT nástroje a jak mi mohou pomoct?

source: You will put your document to be translated into the /source folder; the /target folder will be filled with your translated text; the /omegat folder need not concern you now; the /tm and /glossary files will remain empty unless and until you create a .tmx file and a glossary and put them into those respective folders; the /dictionary folder is where you can put bilingual dictionaries, if you wish, in the appropriate format (see User’s Manual)..
cs_cz: Dokument, který chcete přeložit vložte do složky /source, do složky /target bude vložen přeložený text, složka /omegat vás momentálně nemusí zajímat. Složky /tm a /glossary zůstanou prázdné do té doby, než vytvoříte .tmx soubor a glosář a do těchto složek je nevložíte. Do složky /dictionary můžete vložit své dvojjazyčné slovníky, které musí být ve vhodném formátu (viz. Manuál)..

source: by Susan Welsh & Marc Prior
cs_cz: od Susan Welshové a Marca Priora

source: construction
cs_cz: stavebnictví

source: medicine
cs_cz: lékařství

source: russian-miscellaneous
cs_cz: ruština - různé

source: stocks
cs_cz: akcie

source: swimming
cs_cz: plavání

source: yoga
cs_cz: jóga
